controllers/PostController.php

    public function actionIndex()
    {
        $posts = Post::find()->orderBy(['date' => SORT_DESC])->all();
---
SELECT * FROM `post` ORDER BY `date` DESC

    public function actionCreate()
    {
        $model = new Post();
        if ($model->load(Yii::$app->request->post())) {
            $model->username = Yii::$app->user->identity->username; // ambil username login
            $model->date = date('Y-m-d H:i:s'); // isi tanggal sekarang
            if ($model->save()) {
---
INSERT INTO `post` (`username`, `date`) VALUES ('admin', '2025-08-21 08:14:18')