models/Account.php

SELECT * FROM `account` WHERE `username`='author'
---
    public static function findIdentity($username)
    {
        return static::findOne(['username' => $username]);

SELECT * FROM `account` WHERE `username`='admin'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);