models/RegisterForm.php

INSERT INTO `account` (`username`, `password`, `name`, `role`) VALUES ('admin', '$2y$13$DLuIn/Hnqw7PERfYgV/e4eFTWOgXxEVwq7amFTOdIcptxmP7KXPwy', 'sylvia', 'admin')
---
    public function register()
    {
        if ($this->validate()) {
            $account = new Account();
            $account->username = $this->username;
            $account->password = $this->password; // akan di-hash di beforeSave
            $account->name = $this->name;
            $account->role = $this->role;

            if ($account->save()) {